Kiliman-im/esp32c6-thread-border-router/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.1.0 Project Minimal Configuration
#

# Compiler optimization: needed to fit the firmware in 4 MB flash.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS=y

# ESP-IDF platform, coexistence, console, and task stack configuration.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3584
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Example application Wi-Fi credentials and Thread connection behavior.
CONFIG_EXAMPLE_CONNECT_THREAD=n
CONFIG_EXAMPLE_WIFI_PASSWORD="YourPassword"
CONFIG_EXAMPLE_WIFI_SSID="YourSSID"

# Build target: ESP32-C6 with native Wi-Fi and IEEE 802.15.4 support.
CONFIG_IDF_TARGET="esp32c6"

# Newlib nano keeps printf formatting support small.
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y

# IPv6 forwarding, addressing, multicast, and routing hooks for the backbone.
CONFIG_LWIP_HOOK_IP6_INPUT_CUSTOM=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_IP6_SELECT_SRC_ADDR_CUSTOM=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_FORWARD=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y

# Default application logging verbosity.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# DTLS and EC-JPAKE support for secure Thread commissioning.
CONFIG_MBEDTLS_ECJPAKE_C=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

CONFIG_MDNS_MAX_SERVICES=64

# OpenThread border-router services and automatic Thread network startup.
CONFIG_OPENTHREAD_BORDER_ROUTER=y
CONFIG_OPENTHREAD_CLI_WIFI=n
CONFIG_OPENTHREAD_COMMISSIONER=y
CONFIG_OPENTHREAD_CONSOLE_ENABLE=n
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_JOINER=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_WARN=y
CONFIG_OPENTHREAD_NETWORK_AUTO_START=y
CONFIG_OPENTHREAD_RADIO_NATIVE=y

# Use the project-specific partition table.
CONFIG_PARTITION_TABLE_CUSTOM=y

